# Q1.
(80 + 75 + 55)/3

# Q2.
13 % 2 

# Q3. 
id = '881120-1068234'
'19'+id[:6] #생년월일
id[7:]

# Q4.
pin = "881120-1068234"
pin[0]

# Q5.
a = "a:b:c:d"
a.replace(":","#")

# Q6.
l1 = [1, 3, 5, 4, 2]
l1.sort()
l1.reverse()
l1

# Q7.
' '.join(['Life', 'is', 'too', 'short'])

# Q8.
t1 = (1,2,3)
t1 + (4,)

# Q9.
#2번/ key값이 튜플이라서? 

# Q10.
a = {'A':90, 'B':80, 'C':70}
a.pop('B')

# Q11.
a = [1, 1, 1, 2, 2, 3, 3, 3, 4, 4, 5]
set(a)

# Q12.
a = b = [1, 2, 3]
a[1] = 4
print(b)
#같이 수정된다. 주소값이 같게 설정되기 때문에

